#### PANDAS SELECT COLUMNS BY NAME OR INDEX

##### Use DataFrame.loc[] and DataFrame.iloc[] to select a single column or multiple columns from pandas DataFrame by column names-label or index position respectively. Where lo[] is used with column labels/name and iloc[] is used with column index/position. you can also use these operators to select rows from pandas DataFrame. Also, refer to a related article how to get cell value from pandas DataFrame.

##### Pandas DataFrame is a two-dimensional tabular data structure with labeled axes. columns and rows. Selecting columns from DataFrame Result in a new DataFrame containing only specified select columns rom the original DataFrame

##### 1. Quick Examples of Select columns form pandas DataFrame

In [53]:
import pandas as pd

In [54]:
technologies = {
    'Courses' : ["Spark","PySpark",'Hadoop', 'Apache'],
    'Fee' : [20000,25000,30000, 25000],
    'Duration' : ['30 days', '40 days', '50 days', '35 Days'],
    'Discount': [1000,2300, 4000, 2500]
}

df= pd.DataFrame(technologies)

In [55]:
df

   Courses    Fee Duration  Discount
0    Spark  20000  30 days      1000
1  PySpark  25000  40 days      2300
2   Hadoop  30000  50 days      4000
3   Apache  25000  35 Days      2500

##### Select Columns **BY NAME**

In [56]:
df

   Courses    Fee Duration  Discount
0    Spark  20000  30 days      1000
1  PySpark  25000  40 days      2300
2   Hadoop  30000  50 days      4000
3   Apache  25000  35 Days      2500

In [57]:
df[['Courses', 'Fee', 'Duration']]

   Courses    Fee Duration
0    Spark  20000  30 days
1  PySpark  25000  40 days
2   Hadoop  30000  50 days
3   Apache  25000  35 Days

In [58]:
# With index
df.loc[0:2, ['Courses', 'Duration']]

   Courses Duration
0    Spark  30 days
1  PySpark  40 days
2   Hadoop  50 days

##### Selct Column **BY INDEX**

In [59]:
df

   Courses    Fee Duration  Discount
0    Spark  20000  30 days      1000
1  PySpark  25000  40 days      2300
2   Hadoop  30000  50 days      4000
3   Apache  25000  35 Days      2500

In [60]:
df.iloc[0:2,0:2]

   Courses    Fee
0    Spark  20000
1  PySpark  25000

##### As we can see, if we use loc to print rows, include the last values, othewise, if we use iloc don't include the las value

In [61]:
s = pd.Series([1,2,3,4,5,6,7,8,9], index=['a','b','c','d','e','f','g','h','i'])
s

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
i    9
dtype: int64

In [62]:
variable = s['e']
variable

5

In [63]:
variable = variable * 5
variable

25

In [64]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i'], dtype='object')

In [65]:
s.index[0]

'a'

##### Asignment index of the his series

In [66]:
df

   Courses    Fee Duration  Discount
0    Spark  20000  30 days      1000
1  PySpark  25000  40 days      2300
2   Hadoop  30000  50 days      4000
3   Apache  25000  35 Days      2500

In [67]:
df.set_index('Courses')

           Fee Duration  Discount
Courses
Spark    20000  30 days      1000
PySpark  25000  40 days      2300
Hadoop   30000  50 days      4000
Apache   25000  35 Days      2500

In [68]:
df.reset_index

<bound method DataFrame.reset_index of    Courses    Fee Duration  Discount
0    Spark  20000  30 days      1000
1  PySpark  25000  40 days      2300
2   Hadoop  30000  50 days      4000
3   Apache  25000  35 Days      2500>

In [69]:
df

   Courses    Fee Duration  Discount
0    Spark  20000  30 days      1000
1  PySpark  25000  40 days      2300
2   Hadoop  30000  50 days      4000
3   Apache  25000  35 Days      2500